{
	"jokes": [
		"Jason? J-S-O-N? Or J-Son? The debate continues.",
		"Eight bytes walk into a bar.  The bartender asks, Can I get you anything? Yeah, reply the bytes.  Make us a double.",
		"Q. How did the programmer die in the shower? A. He read the shampoo bottle instructions: Lather. Rinse. Repeat.",
		"How many programmers does it take to change a light bulb? None – It’s a hardware problem",
		"Why do programmers always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
		"There are only 10 kinds of people in this world: those who know binary and those who don’t.",
		"A programmer walks to the butcher shop and buys a kilo of meat.  An hour later he comes back upset that the butcher shortchanged him by 24 grams.",
		"Programming is 10% science, 20% ingenuity, and 70% getting the ingenuity to work with the science.",
		"There are three kinds of lies: Lies, damned lies, and benchmarks.",
		"All programmers are playwrights, and all computers are lousy actors.",
		"Have you heard about the new Cray super computer?  It’s so fast, it executes an infinite loop in 6 seconds.",
		"The generation of random numbers is too important to be left to chance.",
		"I just saw my life flash before my eyes and all I could see was a close tag…",
		"The computer is mightier than the pen, the sword, and usually, the programmer.",
		"Debugging: Removing the needles from the haystack.",
		"The three most dangerous things in the world are a programmer with a soldering iron, a hardware engineer with a software patch, and a user with an idea.",
		"One hundred little bugs in the code. One hundred little bugs. Fix a bug, link the fix in, One hundred little bugs in the code.",
		"Programmer 1: We have a problem. Programmer 2: Let’s use RegEx! Programmer 1: Now we have two problems",
		"A SQL query goes to a restaurant, walks up to 2 tables and says Can I join you?",
		"Does God control everything that happens in my life? He could if he used the debugger, but it's tedious to step through all those variables."
	]
}